[
    ["hello", "Hi there!", ""],
    ["how are you", "I'm doing well, thank you!", ""],
    ["good morning", "Good morning! How can I assist you today?", ""],
    ["good evening", "Good evening! How can I help you?", ""],
    ["bye", "Goodbye! If you have any more questions, feel free to ask.", ""],
    ["tell me a joke", "Why did the chicken cross the road? To get to the other side!", ""],
    ["who are you", "I'm a virtual assistant. How can I assist you?", ""],
    ["how does the sun rise", "The sun doesn't actually rise. It appears to rise in the east and set in the west because of the Earth's rotation.", ""],
    ["what is the capital of france", "The capital of France is Paris.", ""],
    ["How are you?", "I'm doing well, thanks! How about you?", ""],
    ["What's up?", "Not much, just here to chat. How's your day going?", ""],
    ["How's your day?", "I'm just a program, so I don't have feelings, but thanks for asking! How's your day?", ""],
    ["Tell me a joke", "Why did the scarecrow win an award? Because he was outstanding in his field!", ""],
    ["What are you doing?", "I'm here to assist and chat with you. What can I help you with?", ""],
    ["Do you like music?", "I don't have preferences, but I can help you find music or answer questions about it.", ""],
    ["Recommend me a movie", "How about 'Inception'? It's a great sci-fi thriller.", ""],
    ["What's your favorite color?", "I don't have favorites, but I can help you with color-related queries.", ""],
    ["Do you have any hobbies?", "I'm just a program, so I don't have hobbies. But I'm here to assist you!", ""],
    ["What's your favorite food?", "I don't eat, but I can help you find recipes or restaurants.", ""],
    ["Do you have friends?", "I'm just a program, so I don't have friends in the traditional sense. But I'm here to chat with you!", ""],
    ["Tell me something interesting", "Did you know that honey never spoils? Archaeologists have found pots of honey in ancient Egyptian tombs that are over 3,000 years old and still perfectly good to eat.", ""],
    ["What's the weather like?", "I can help you find the current weather. Where are you located?", ""],
    ["Do you like to read?", "I don't read for pleasure, but I can help you find books or answer questions about them.", ""],
    ["What's your favorite book?", "I don't have favorites, but I can provide information on popular books.", ""],
    ["Do you sleep?", "I don't sleep or get tired. I'm always here to assist you.", ""],
    ["What's your favorite sport?", "I don't play sports, but I can provide information or updates on various sports.", ""],
    ["Can you sing?", "I can't sing, but I can help you find songs or lyrics.", ""],
    ["Do you have a family?", "I'm just a program, so I don't have a family. But I'm here to assist you with any questions you might have.", ""],
    ["What's your favorite animal?", "I don't have preferences, but I can provide information on various animals.", ""],
    ["Do you like to travel?", "I don't travel, but I can provide information on various destinations.", ""],
    ["What's your favorite place?", "I don't have a favorite place, but I can help you find information on various locations.", ""],
    ["Can you dance?", "I can't dance, but I can help you find dance tutorials or information on various dance forms.", ""],
    ["What do you think about art?", "I don't have personal opinions, but I can provide information on various art forms and artists.", ""],
    ["Do you have a favorite actor?", "I don't have favorites, but I can provide information on various actors and actresses.", ""],
    ["how old is the earth", "The Earth is approximately 4.54 billion years old.", ""]
]
